Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/social_insurance_prsi/benefit_and_contribution_years_for_social_welfare_purposes.html.txt.tmx
Source language: en
Languages: ga

source: Benefit and contribution years for social welfare purposes
ga: Blianta sochair agus ranníocaíochta ar mhaithe le híocaíochtaí leasa shóisialaigh

source: To qualify for most social insurance payments in Ireland, a person must satisfy two conditions, first have a certain number of PRSI contributions paid since they started work and secondly, they must have a certain number of PRSI contributions paid or credited in a specific period, that is, in the relevant or governing contribution year
ga: Ní mór do dhuine dhá choinníoll a chomhlíonadh má tá sé nó sí chun íocaíochtaí árachais shóisialta a fháil in Éirinn. Ar an gcéad dul síos caithfidh sé/sí oiread áirithe ranníocaíochaí ÁSPC a bheith déanta acu ón am ar thosaigh siad ag obair agus lena chois sin caithfidh siad líon áirithe ranníocaíochtaí ÁSPC a bheith déanta acu i dtréimhse áirithe faoi leith nó creidiúint a fháil dóibh

source: The number of contributions needed varies from benefit to benefit
ga: Is ionann an tréimhse sin agus an bhliain ranníocaíochta chuí a bhaineann leis an bhliain atá i gceist

source: The Relevant Tax Year or Governing Contribution Year is 2 years before the Benefit Year
ga: Is í an Bhliain Chánach Ábhartha atá i gceist (nó an bhliain rialaithe ranníocaíochtaí) ná an bhliain a bhí ann dhá bhliain roimh an Bhliain Sochair

source: So, for claims in 2017, the Relevant Contribution Year is 2015
ga: Mar sin, sí 2015 an Bhliain Ranníocaíochtaí atá i gceist maidir le hiarratais i 2017

source: One exception to this is Invalidity Pension, the relevant tax year for Invalidity Pension is the year before the benefit year
ga: Is eisceacht é Pinsean Easláinte. Is í an bhliain chánach ábhartha do Phinsean Easláinte ná an bhliain a bhí ann bhliain roimh an bhliain sochair

source: So, for claims in 2017, the relevant tax year is 2016
ga: Mar sin, sí 2016 an bhliain chánach ábhartha atá i gceist maidir le hiarratais i 2017

source: The Benefit Year is not the same as the calendar year which begins on 1 January. The Benefit Year is the 12 months beginning on the first Monday of the calendar year
ga: Ní féidir a rá go baileach gurbh í an bhliain a thosaíonn ar an 1 Eanáir an Bliain Sochair mar sí an 12 mhí a thosaíonn ar an gcéad Luan de réir féilire na bliana sin an bhliain atá i gceist, cé go mbíonn eisceachtaí ann

source: In 2017, the first Monday in January fell on 2 January, therefore, claims made on 1 January would be based on an earlier Contribution Year
ga: I 2017, mar shampla ba é an 2 Eanáir an chéad Luan sa bhliain agus ar an ábhar sin níor mhór d'iarratais a rinneadh suas go dtí an 1 Eanáir a bheith bunaithe ar Bhliain íocaíochtaí níos luaithe

source: In some cases, this could make a difference to the person claiming
ga: D'fhéadfadh sé seo difríocht a dhéanamh i gcásanna áirithe don té a bheadh ag éileamh

source: For example, a claim for Jobseeker's Benefit on 1 January 2017 would be based on PRSI contributions in 2014, whereas a claim for Jobseeker's Benefit on 7 January 2017 would be based on PRSI contributions in 2015
ga: Mar shampla, beadh iarratas ar Shochar Cuardaitheora Poist a rinneadh an 1 Eanáir 2017 bunaithe ar ranníocaíochtaí ÁSPC a bheith déanta i 2014 ach beadh iarratas ar Shochar Cuardaitheora Poist a rinneadh an 7 Eanáir 2017 bunaithe ar ranníocaíochtaí ÁSPC a bheith déanta i 2015

source: If you are a part-time worker, you may not be making the maximum amount of PRSI contributions each year
ga: Mar fhostaí páirtaimseartha, tá seans ann nach bhfuil an t-uasmhéid ranníocaíochtaí ÁSPC á déanamh agat gach bliain

source: See Part-time work and social insurance (PRSI) for more information
ga: Léigh tuillleadh faoi Fostaíocht pháirtaimseartha agus árachas sóisialach anseo
